# brew taps
tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "teamookla/speedtest"
tap "xo/xo"

# brew formulaes
brew "automake"
brew "bat"
brew "ccls"
brew "cmake"
brew "fontconfig"
brew "fzf"
brew "gcc"
brew "gmp"
brew "go"
brew "helm"
brew "icu4c"
brew "k9s"
brew "kafkacat"
brew "kubernetes-cli"
brew "openssl@1.1"
brew "openvpn"
brew "libyaml"
brew "llvm"
brew "luajit"
brew "macvim"
brew "minikube"
brew "ncurses"
brew "neovim"
brew "nvm"
brew "python@3.8"
brew "rbenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "speedtest"
brew "tldr"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "unbound"
brew "usql"
brew "vim"
brew "watchman"
brew "wimlib"

# brew casks
cask "adoptopenjdk"
cask "android-studio"
cask "another-redis-desktop-manager"
cask "dbeaver-community"
cask "clover-configurator"
cask "discord"
cask "firefox"
cask "font-hack-nerd-font"
cask "gifcapture"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gotiengviet"
cask "iterm2"
cask "karabiner-elements"
cask "kindle"
cask "lens"
cask "messenger"
cask "microsoft-office"
cask "monitorcontrol"
cask "ngrok"
cask "postman"
cask "react-native-debugger"
cask "send-to-kindle"
cask "skype"
cask "slack"
cask "steam"
cask "teamviewer"
cask "tunnelblick"
cask "zalo"
